
#Дано список цілих чисел. Написати функцію для знаходження кількість усіх пар однакових елементів.
#Приклад:
#[1,2,3,1,1,3] -> 4 пари з індексами (0,3), (0,4), (3,4), (2,5).
def myfunction(mylist):
    count = 0
    for i in range(len(mylist)):
        for j in range(i+1, len(mylist)):
            if mylist[i]==mylist[j]:
              count += 1
    return count
#обчислити n-не число фібоначі


# Створимо дві змінні з однаковим значенням
a = 42
b = 42

# Перевіримо, що вони мають однакові адреси в пам'яті
